Catalogs/фин_ПоляПользовательскихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ПоляПользовательскихОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ШаблоныПользовательскихОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_СпособыОтображенияПолейПользовательскихОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПоля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РолиПолейПользовательскихОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыСортировкиПользовательскихОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгрегатнаяФункция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИтоговыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_РолиПолейПользовательскихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_РолиПолейПользовательскихОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_СпособыОтображенияПолейПользовательскихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособыОтображенияПолейПользовательскихОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСоответствиюИзмерениямБюджетирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПользовательскомуПредставлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_ПоляПользовательскихОтчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РольПоляПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособОтображенияПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
    Элементы.Сортировка.Видимость = Объект.РольПоля=ПредопределенноеЗначение("Перечисление.фин_РолиПолейПользовательскихОтчетов.Измерение");
    Элементы.АгрегатнаяФункция.Видимость = Объект.РольПоля<>ПредопределенноеЗначение("Перечисление.фин_РолиПолейПользовательскихОтчетов.Измерение");
    Элементы.Измерение.Видимость = Объект.СпособОтображения=ПредопределенноеЗначение("Перечисление.фин_СпособыОтображенияПолейПользовательскихОтчетов.ПоСоответствиюИзмерениямБюджетирования");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.ЗаполнитьСписокРазрезовУчета(СписокВыбораРазрезыУчета);
	фин_УправлениеОтчетамиБюджетирование.НастроитьРасширенноеПредставлениеРазрезов(ЭтотОбъект,"Измерение","",Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораРазрезыУчета;
КонецПроцедуры
